app/views/posts/_form.html.erb

      <%= form.label :user%>
      <%= form.select :user_id, User.all.pluck(:name, :id), { prompt: 'Select' }, { class: "form-control" } %>
---
SELECT `users`.`name`, `users`.`id` FROM `users`